# Read Write Excel CSV File

Today:
1. Read csv
2. Write csv
3. Read excel
4. Write excel

# Reading CSV

CSV file = comma separated values file. It is is a plain text file that contains a list of data. These files are often used for exchanging data between different applications. It can be opened by many programs, but is often opened by a spreadsheets program such as Excel.

In [3]:
import pandas as pd
df = pd.read_csv("7-4_stock_data.csv")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

Note = the last "people" column was too narrow...text was being cut off. So the **df** created another column called "unnamed". To fix that, make the column wider. 

## Headers

### If you have a main header...
The video talks about what happens when you have another header row. For instance, if there were a row above the column titles that said "stock data". The df would then show "stock data" was the first column's name, and "unnamed" as the other column names. And "tickers", "eps", "revenue", etc. would be index 0.

If you want to have a header row such as "stock data", you want to skip the row in the df. So you'd write: **df = pd.read_scv("7-4_stock_data.csv", skprows=1)** to skip the first row. 

Or, you can do **df = pd.read_scv("7-4_stock_data.csv", header=1)**. That will give you the same output. The "header" is located in row 1. 

### If you have no headers at all (no column titles)...
If you don't have a header at all (i.e. no column titles such as "tickers", "eps", etc.) and instead just already know what the columns stand for, then you can write **df = pd.read_scv("7-4_stock_data.csv", header=None)**. It will automatically generate column names. But the column names aren't good. You can supply column names like: **df = pd.read_scv("7-4_stock_data.csv", header=None, names=["ticker","eps"])**.

In [4]:
import pandas as pd
df = pd.read_csv("7-4_stock_data.csv", nrows=3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [6]:
import pandas as pd
df = pd.read_csv("7-4_stock_data.csv", na_values=["not available","n.a."])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3     RIL    NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [7]:
import pandas as pd
df = pd.read_csv("7-4_stock_data.csv", na_values={
    'eps': ["not available", "n.a."],
    'revenue': ["not available", "n.a.", -1],
    'people': ["not available", "n.a."]
    })
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3     RIL    NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

**nrows** = Will tell Pandas how many rows (not including header) to read.

**na_values** = Replaces all "not available" and "n.a." values to **NaN**. Helps to clean up the messy data.

In "revenue", the -1 is a problem because companies don't usually report negative number for revenue...want to convert to NaN. But we don't want to convert the "eps" -1.00 to NaN, so we don't want to tell **na_values** to also search for "-1" because that will convert both the revenue -1 and the eps -1.00 to NaN. 

Instead, we can include a dictionary in **na_values** and specify which columns (keys) convert what values to NaN.

# Writing Back to CSV

In [8]:
df.to_csv('new.csv')

In [9]:
df.to_csv('new.csv', index=False)

In [10]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [11]:
df.to_csv("new.csv",columns=['tickers','eps'])

In [12]:
df.to_csv('new.csv', header=False)

Writing the current **df** to a new CSV file called **new.csv**. Will find the file in that same directory.

The first time, the index (0-4) will be copied into the new CSV file. If you don't want to include the index, then use **index=False**.

If you don't want to export all columns, you can write **df.to_csv("new.csv",columns=['tickers','eps'])**

If you want to skip exporting the header, you can do **df.to_csv('new.csv', header=False)**.

# Reading Excel

In [14]:
import pandas as pd
df = pd.read_excel("7-4_stock_data.xlsx", "Sheet1")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [16]:
import pandas as pd

def convert_people_cell(cell):
    if cell=="n.a.":
        return 'sam walton'
    return cell

def convert_eps_cell(cell):
    if cell=="not available":
        return None
    return cell

df = pd.read_excel("7-4_stock_data.xlsx", "Sheet1", converters={
    'people': convert_people_cell,
    'eps': convert_eps_cell,
    })
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

The first example shows how to read the excel file.

So it says "n.a." in the "people" column for Walmart (WMT), but we know that it should be Sam Walton. So, we can write a function called **convert_people_cell**. The function searches the people cells. if it sees "n.a." it will return "sam walton". Otherwise, it will return the cell as is. 

Then, in the read excel file, use the **converters** argument. It will take a Python dictionary. In the dictionary, for the "people" column, use the **convert_people_cell** function. This means that as it is reading the "people" column, it will use the function for every cell. 

This is just a basic example. Can use **converters** for other things like writing functions for reading the "eps" column, etc. The "eps" example is also shown.

**converters** basically allows you to convert messy data into something meaningful.

# Writing Back to Excel

In [18]:
df.to_excel("new.xlsx",sheet_name="stocks")

In [19]:
df.to_excel("new.xlsx",sheet_name="stocks", startrow=1, startcol=2)

In [20]:
df.to_excel("new.xlsx",sheet_name="stocks", startrow=1, startcol=2, index=False)

Same as in CSV writing, you can eliminate the index numbers, skip exporting headers/columns, etc.

Also, you can do **startrow** and **startcol** to tell when to start the data. Offset the data.

In [33]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12],
})

df_weather = pd.DataFrame({
    'day': ['1/1/2017', '1/2/2017', '1/3/2017'],
    'temperature': [32, 35, 28],
    'event': ['Rain', 'Sunny', 'Snow'],
})

In [34]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")

To write two dataframes into the same Excel file...

First, create two separate dataframes. Write both dataframes into one single Excel file as two different sheets. 

Then use the **ExcelWriter** class from Pandas. Use the name of the Excelt file as **writer**. The **writer** will write the dataframes that follow.